# Pandas Basic

### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
data = [4,8,15,16,23,42]
pd_series = pd.Series(data)

In [3]:
type(pd_series
    )

pandas.core.series.Series

In [5]:
print(pd_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
for i in pd_series:
    print(i)

4
8
15
16
23
42

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [7]:
var = ['a', 'b', 'c', 1, 2, 3, 4, 5, 6, 7]

In [8]:
pd_series1 = pd.Series(var)

In [9]:
pd_series1

0    a
1    b
2    c
3    1
4    2
5    3
6    4
7    5
8    6
9    7
dtype: object

## Q3. Create a Pandas DataFrame that contains the following data: Then, print the DataFrame.

In [10]:
list_dict = [
    {'Name':'Alice','Age':25,'Gender':'Female'},
    {'Name':'Bob','Age':30,'Gender':'Male'},
    {'Name':'Claire','Age':27,'Gender':'Female'},
]

In [18]:
data = {
    'Name':['Alice','Bob','Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

In [20]:
df = pd.DataFrame(data)

In [21]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [14]:
df = pd.DataFrame.from_records(list_dict)

In [16]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [17]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is a 2D data structure.It is used to represent data in tabular format in rows and columns where as pandas seried is a single dimension arrays holding data of any type like a column in a table.

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Common function to manipulate data in Pandas DataFrame are 
1.)df.drop('column_name',axis=1) :- Remove column from data frame.
2.)df.rename(columns={'actual_name':'changed_name'}) :- Renaming a columns in the dataset.
3.)df.select_dtypes('int') :- Select columns with specific data types.
4.)df.iloc() and df.loc() :- slicing the dataset
5.)df.duplicated() :- Handle dublicate in dataset

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

DataFrame

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [22]:
courses = pd.Series(['Spark', 'PySpark', 'Hadoop'])
fees = pd.Series([22000, 12000, 20000])
discount = pd.Series([1000, 2000, 3000])

In [23]:
df = pd.concat([courses,fees,discount],axis=1)

In [24]:
df

         0      1     2
0    Spark  22000  1000
1  PySpark  12000  2000
2   Hadoop  20000  3000